-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Окт 13 2024 г., 14:01
-- Версия сервера: 10.4.32-MariaDB
-- Версия PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `sotrudniki`
--

-- --------------------------------------------------------

--
-- Структура таблицы `sotr`
--

CREATE TABLE `sotr` (
  `ID` int(11) NOT NULL,
  `FIO` varchar(75) NOT NULL,
  `DataRozhdenia` date NOT NULL,
  `Pasport` varchar(15) NOT NULL,
  `KontaktnayaInfa` varchar(75) NOT NULL,
  `Adres` varchar(75) NOT NULL,
  `Otdel` varchar(75) NOT NULL,
  `Dolzhnost` varchar(75) NOT NULL,
  `Zarplata` int(11) NOT NULL,
  `DataPrinatia` date NOT NULL,
  `Statusr` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `sotr`
--

INSERT INTO `sotr` (`ID`, `FIO`, `DataRozhdenia`, `Pasport`, `KontaktnayaInfa`, `Adres`, `Otdel`, `Dolzhnost`, `Zarplata`, `DataPrinatia`, `Statusr`) VALUES
(1, 'Круглова Валерия Павловна', '1994-07-07', '7656 456789', '+7(900)654-32-32', 'ул.Пушкина д.67', 'Кадров', 'Рекрутер', 95000, '2020-07-09', 'Уволен'),
(2, 'Щербаков Алексей Ильич', '2001-03-08', '7656 453453', '+7(900)654-32-67', 'ул.Павлова д.78', 'Маркетинг', 'Начальник отдела', 100000, '2017-10-11', 'Работает'),
(3, 'Черных Арсений Валерьевич', '1999-06-05', '9845 452041', '+7(921)652-32-65', 'ул.Блюхера д.23', 'Бухгалтерия', 'Главный бухгалтер', 98000, '2021-06-12', 'Уволен'),
(4, 'Алехина Евгения Ивановна', '1992-01-30', '8565 858585', '+7(921)548-34-32', 'ул.Урицкого д.14', 'Бухгалтерия', 'Бухгалтер-стажер', 24000, '2024-08-02', 'Работает'),
(5, 'Панова Анастасия Евгеньевна', '1997-02-24', '8798 654789', '+7(921)345-25-36', 'ул.Гагарина д.14', 'IT', 'Тестировщик', 100000, '2022-06-23', 'Работает'),
(6, 'Воробьева Анна Алексеевна', '2000-02-16', '8798 845785', '+7(921)345-32-89', 'ул.Колотушкина д.89', 'Кадров', 'Менеджер по персоналу', 80000, '2021-06-24', 'Уволен'),
(7, 'Седов Александр Сергеевич', '1997-09-01', '8795 932545', '+7(921)488-98-98', 'ул.Первомайская д.45', 'IT', 'Разработчик', 86000, '2020-01-19', 'Работает'),
(8, 'Денисов Максим Маркович', '2000-06-10', '4567 787878', '+7(900)800-00-00', 'ул.Кирова д.88', 'Маркетинг', 'SMM-специалист', 85000, '2022-05-23', 'Уволен'),
(9, 'Меркулов Али Матвеевич', '2001-06-09', '3454 456456', '+7(900)300-54-54', 'ул.Чкалова д.12', 'Маркетинг', 'Интернет-маркетолог', 54000, '2021-06-09', 'Работает'),
(10, 'Антонова Мария Платоновна', '1998-06-13', '4584 685261', '+7(921)876-76-00', 'ул.Кирова д.88', 'Маркетинг', 'Медиапланер', 56000, '2024-10-01', 'Уволен'),
(11, 'Шишкина Евангелина Никитична', '1996-06-20', '9547 584565', '+7(921)545-85-86', 'ул.Панина д.15', 'IT отдел', 'Специалист техподдержки', 89000, '2023-06-22', 'Работает'),
(12, 'Козлова Алиса Львовна', '2000-06-06', '6548 975615', '+7(920)520-52-02', 'ул.Панина д.45', 'Маркетинг', 'SMM-специалист', 76000, '2023-02-13', 'Работает'),
(13, 'Софронов Артём Степанович', '1999-06-24', '6545 654565', '+7(900)548-74-74', 'ул.Урицкого д.78', 'Бухгалтерия', 'Ведущий Бухгалтер', 78000, '2022-06-23', 'Работает');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `sotr`
--
ALTER TABLE `sotr`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `sotr`
--
ALTER TABLE `sotr`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
